Step 3: Importing libraries

In [1]:
# Import analysis libraries

import pandas as pd
import numpy as np
import os

In [2]:
# Create a path
path = r"C:\Users\Emily\01-2026 Instacart Basket Analysis"

In [3]:
# Importing dataframe
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [4]:
# Checking the outputs
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
# Checking the total numbers of rows and columns
df_customers.shape

(206209, 10)

Step 4: Wrangling

In [28]:
# Renaming columns
df_customers.rename(columns = {'Surnam' : 'Last Name'}, inplace = True)

In [29]:
df_customers.rename(columns = {'gender' : 'Gender'}, inplace = True)

In [30]:
df_customers.rename(columns = {'STATE' : 'State'}, inplace = True)

In [31]:
df_customers.rename(columns = {'date_joined' : 'Date Joined'}, inplace = True)

In [32]:
df_customers.rename(columns = {'n_dependants' : 'Number of Dependants'}, inplace = True)

In [33]:
df_customers.rename(columns = {'fam_status' : 'Marital Status'}, inplace = True)

In [34]:
df_customers.rename(columns = {'income' : 'Income'}, inplace = True)

In [35]:
# Checking the output
df_customers.head()

,user_id,First Name,Last Name,Gender,State,Age,Date Joined,Number of Dependants,Marital Status,Income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [36]:
# Checking the data types
df_customers.dtypes

user_id                 object
First Name              object
Last Name               object
Gender                  object
State                   object
Age                      int64
Date Joined             object
Number of Dependants     int64
Marital Status          object
Income                   int64
dtype: object

I will not need to calculate stats for the variable User ID. Since its data type is int64, i'll change it to a string data ype.

In [37]:
# Changing to string data type
df_customers['user_id'] = df_customers['user_id'].astype('str')

I believe all columns are necessary. Therefore, I will not be dropping any columns. Aslo, there is no need to transpose data.

Step 5: Data Quality and Consistency Checks

In [38]:
# Checking the descriptive statistics for dataframe
df_customers.describe()

                 Age  Number of Dependants         Income
count  206209.000000         206209.000000  206209.000000
mean       49.501646              1.499823   94632.852548
std        18.480962              1.118433   42473.786988
min        18.000000              0.000000   25903.000000
25%        33.000000              0.000000   59874.000000
50%        49.000000              1.000000   93547.000000
75%        66.000000              3.000000  124244.000000
max        81.000000              3.000000  593901.000000

In [39]:
# Checking for mixed-type columns
for col in df_customers.columns.tolist():
    weird = (df_customers[[col]].map(type) != df_customers
             [[col]].iloc[0].apply(type)).any(axis = 1)
    if len(df_customers[weird]) > 0:
        print(col)

In [40]:
# Fixing mixed-type column: First Name
df_customers['First Name'] = df_customers['First Name'].astype('str')

In [41]:
# Checking the output
df_customers['First Name'].dtype

dtype('O')

In [42]:
# Finding missing values
df_customers.isnull().sum()

user_id                 0
First Name              0
Last Name               0
Gender                  0
State                   0
Age                     0
Date Joined             0
Number of Dependants    0
Marital Status          0
Income                  0
dtype: int64

Everythig is good here. No missing values.

In [43]:
# Finding any duplicates
df_dups = df_customers[df_customers.duplicated()]

In [44]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Last Name, Gender, State, Age, Date Joined, Number of Dependants, Marital Status, Income]
Index: []

No duplicates found.

Step 6: Combine customer data with the rest of the prepared Instacart data

In [45]:
# Importing the prepared dataframe
df_prepared_dataframe = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_grouped.pkl'))

In [46]:
# Checking the output
df_prepared_dataframe.shape

(1000000, 25)

In [47]:
df_prepared_dataframe.head()

,product_id,product_name,aisle_id,department_id,prices,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_product_price,spending_flag,median_days_between_orders,order_frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,1987,3139998,138,28,6,...,Mid-range product,Regularly busy,Regularly busy,Most orders,30,Regular customer,12.900000,High spender,6.5,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1989,1977647,138,30,6,...,Mid-range product,Regularly busy,Regularly busy,Average orders,30,Regular customer,12.900000,High spender,6.5,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,11433,389851,709,2,0,...,Mid-range product,Busiest day,Busiest days,Average orders,5,New customer,5.288889,Low spender,7.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,12198,652770,764,1,3,...,Mid-range product,Regularly busy,Slowest days,Most orders,3,New customer,5.800000,Low spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,12200,1813452,764,3,4,...,Mid-range product,Least busy,Slowest days,Average orders,3,New customer,5.800000,Low spender,9.0,Frequent customer

In [48]:
# Making sure the data type matches the one in customers dataframe
df_prepared_dataframe['user_id'].dtype

dtype('int64')

In [49]:
# Converting the data type to a string
df_prepared_dataframe['user_id'] = df_prepared_dataframe['user_id'].astype('str')

In [50]:
# Checking the output
df_prepared_dataframe['user_id'].dtype

dtype('O')

In [51]:
# Combining customer with ords_prods_merge
merged_df = pd.merge(df_prepared_dataframe, df_customers, on='user_id', how='inner')

In [52]:
# Checking merge
merged_df.head()

,product_id,product_name,aisle_id,department_id,prices,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,...,order_frequency_flag,First Name,Last Name,Gender,State,Age,Date Joined,Number of Dependants,Marital Status,Income
0,1,Chocolate Sandwich Cookies,61,19,5.8,1987,3139998,138,28,6,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
1,1,Chocolate Sandwich Cookies,61,19,5.8,1989,1977647,138,30,6,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
2,1,Chocolate Sandwich Cookies,61,19,5.8,11433,389851,709,2,0,...,Frequent customer,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,158302
3,1,Chocolate Sandwich Cookies,61,19,5.8,12198,652770,764,1,3,...,Frequent customer,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308
4,1,Chocolate Sandwich Cookies,61,19,5.8,12200,1813452,764,3,4,...,Frequent customer,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308

In [53]:
# Checking shape
merged_df.shape

(1000000, 34)

In [54]:
# Checking the output
merged_df['_merge'].value_counts()

_merge
both          1000000
left_only           0
right_only          0
Name: count, dtype: int64



Step 8

In [56]:
# Export the new dataframe as a pickle file
merged_df.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_cust_merged_4.9.pkl'))